39) /app/src/Shared/Infrastructure/InvalidContentTypeException.php:13    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
     private const MESSAGE = 'This content type [contentType] is not valid';
     public static function createFromContentType(string $contentType, string $validContenType) : self
     {
-        return new self(str_replace('[contentType]', $contentType, self::MESSAGE . ': ' . $validContenType));
+        return new self(self::MESSAGE . ': ' . $validContenType);
     }
 }

40) /app/src/Shared/Infrastructure/StatusController.php:11    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 use Symfony\Component\Routing\Annotation\Route;
 class StatusController extends BaseController
 {
-    #[Route('/status', name: 'status', methods: ['GET'])]
+    #[Route('/status', name: 'status', methods: [])]
     public function statusAction() : JsonResponse
     {
         return new JsonResponse(null, Response::HTTP_OK);
     }
 }

41) /app/src/Shared/Infrastructure/StatusController.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Component\Routing\Annotation\Route;
 class StatusController extends BaseController
 {
-    #[Route('/status', name: 'status', methods: ['GET'])]
-    public function statusAction() : JsonResponse
+    protected function statusAction() : JsonResponse
     {
         return new JsonResponse(null, Response::HTTP_OK);
     }
 }
